{"_id":{"$oid":"5dd6b06e03b642d590c8401a"},"Title":"V for Vendetta","Description":"Following world war, London is a police state occupied by a fascist government, and a vigilante known only as V uses terrorist tactics to fight the oppressors of the world in which he now lives. When V saves a young woman named Evey from the secret police, he discovers an ally in his fight against England's oppressors.","Genre":{"Name":"Thriller","Description":"Thriller is a genre that revolves around anticipation and suspense. The aim for Thrillers is to keep the audience alert and on the edge of their seats. The protagonist in these films is set against a problem – an escape, a mission, or a mystery."},"Director":{"Name":"James McTeigue","Bio":"James McTeigue is an Australian film director. He has been an assistant director on many films, including Dark City, the Matrix trilogy and Star Wars: Episode II – Attack of the Clones, and made his directorial debut with the film V for Vendetta to critical acclaim. Since Vendetta he has collaborated with the Wachowskis an additional three times as director on The Invasion, Ninja Assassin and Sense8.","Birth":"1967"},"ImagePath":"Insert Image URL here","Featured":true,"Actors":"Natalie Portman"}
{"_id":{"$oid":"5dd6b0ec03b642d590c8401b"},"Title":"Girl, Interrupted","Description":"Set in the changing world of the late 1960s, ‘Girl, Interrupted’ is the searing true story of Susanna Kaysen, a young woman who finds herself at a renowned mental institution for troubled young women, where she must choose between the world of people who belong on the inside -- like the seductive and dangerous Lisa -- or the often difficult world of reality on the outside.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"James Mangold","Bio":"James Mangold is an American film and television director, screenwriter and producer. He is best known for directing the films Logan, Cop Land, Girl, Interrupted, Kate & Leopold, Walk the Line, and 3:10 to Yuma.","Birth":"1963"},"ImagePath":"Insert Image URL here","Featured":false,"Actors":"Angelina Jolie"}
{"_id":{"$oid":"5dd6b15d03b642d590c8401c"},"Title":"The Mummy","Description":"Mummys are scary!","Genre":{"Name":"Action","Description":"Action films are a film genre where action sequences, such as fighting, stunts, car chases or explosions, take precedence over elements like characterization or complex plotting. The action typically involves individual efforts on the part of the hero, in contrast with most war films."},"Director":{"Name":"Stephen Sommers","Bio":"Stephen Sommers is an American film director and screenwriter, best known for big-budget movies, such as The Mummy, its sequel, The Mummy Returns, Van Helsing, and G.I. Joe: The Rise of Cobra.","Birth":"1962"},"ImagePath":"Insert Image URL here","Featured":false,"Actors":["Brendan Fraser","Rachel Weisz"]}
{"_id":{"$oid":"5dd6b39a03b642d590c8401d"},"Title":"The Matrix","Description":"Neo believes that Morpheus, an elusive figure considered to be the most dangerous man alive, can answer his question -- What is the Matrix? Neo is contacted by Trinity, a beautiful stranger who leads him into an underworld where he meets Morpheus. They fight a brutal battle for their lives against a cadre of viciously intelligent secret agents. It is a truth that could cost Neo something more precious than his life.","Genre":{"Name":"Action","Description":"Action films are a film genre where action sequences, such as fighting, stunts, car chases or explosions, take precedence over elements like characterization or complex plotting. The action typically involves individual efforts on the part of the hero, in contrast with most war films."},"Director":{"Name":"The Wachowskis","Bio":"Lana Wachowski (born Laurence Wachowski) and Lilly Wachowski (born Andrew Paul Wachowski)are American film and television directors, writers and producers. The sisters are both trans women. Collectively known as the Wachowskis, they have worked as a writing and directing team through most of their professional film careers. They achieved fame with their second film The Matrix, a major box office success for which they won the Saturn Award for Best Director"},"ImagePath":"Insert Image URL here","Featured":false,"Actors":["Keanu Reeves","Carrie-Anne Moss"]}
{"_id":{"$oid":"5dd6b41b03b642d590c8401e"},"Title":"The Talented Mr. Ripley","Description":"To be young and carefree amid the blue waters and idyllic landscape of sun-drenched Italy in the late 1950s; that's la dolce vita Tom Ripley  craves- and Dickie Greenleaf leads. When Dickie's father asks Tom to bring his errant playboy son back home to America, Dickie and his beautiful expatriate girlfriend, Marge Sherwood, never suspect the dangerous extremes to which Ripley will go to make their lifestyle his own.","Genre":{"Name":"Thriller","Description":"Thriller is a genre that revolves around anticipation and suspense. The aim for Thrillers is to keep the audience alert and on the edge of their seats. The protagonist in these films is set against a problem – an escape, a mission, or a mystery."},"Director":{"Name":"Andrew Minghella","Bio":"Anthony Minghella, CBE was a British film director, playwright and screenwriter. He was chairman of the board of Governors at the British Film Institute between 2003 and 2007. He won the Academy Award for Best Director for The English Patient.","Birth":"1954"},"ImagePath":"Insert Image URL here","Featured":false,"Actors":["Jude Law","Matt Damon"]}
{"_id":{"$oid":"5dd6b48b03b642d590c8401f"},"Title":"Any Given Sunday","Description":"Four years ago, DAmato's Miami Sharks were at the top. Now, his team is struggling with three consecutive losses, sliding attendance, and aging heroes, particularly 39-year-old quarterback Jack ‘Cap’ Rooney. Off the field, DAmato is struggling with a failed marriage and estranged children, and is on a collision course with Christina Pagniacci, the young president/co-owner of the Sharks organization.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Oliver Stone","Bio":"William Oliver Stone is an American filmmaker, director, writer and conspiracy theorist. He won an Academy Award for Best Adapted Screenplay as writer of Midnight Express, and wrote the acclaimed gangster movie Scarface.","Birth":"1946"},"ImagePath":"Insert Image URL here","Featured":false,"Actors":"Dennis Quad"}
{"_id":{"$oid":"5dd6b51d03b642d590c84020"},"Title":"Anywhere But Here","Description":"In this adaptation of the Mona Simpson novel, single mother Adele August is bad with money, and even worse when it comes to making decisions. Her straight-laced daughter, Ann, is a successful high school student with Ivy League aspirations. When Adele decides to pack up and move the two of them from the Midwest to Beverly Hills, Calif., to pursue her dreams of Hollywood success, Ann grows frustrated with her mother's irresponsible and impulsive ways.","Genre":{"Name":"Comedy","Description":"A comedy film is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect. Films in this style traditionally have a happy ending (black comedy being an exception)."},"Director":{"Name":"Wayne Wang","Bio":"Wayne Wang is a Hong Kong-American director, producer, and screenwriter. Considered a pioneer of Asian-American cinema, he was one of the first Chinese-American filmmakers to gain a major foothold in Hollywood.","Birth":"1949"},"ImagePath":"Insert Image URL here","Featured":false,"Actors":["Susan Sarandon","Natalie Portman"]}
{"_id":{"$oid":"5dd6b59803b642d590c84021"},"Title":"E.T.","Description":"After a gentle alien becomes stranded on Earth, the being is discovered and befriended by a young boy named Elliott. Bringing the extraterrestrial into his suburban California house, Elliott introduces E.T., as the alien is dubbed, to his brother and his little sister, Gertie, and the children decide to keep its existence a secret. Soon, however, E.T. falls ill, resulting in government intervention and a dire situation for both Elliott and the alien.","Genre":{"Name":"Science Fiction","Description":"Science fiction film (or sci-fi film) is a genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, alien worlds, extrasensory perception and time travel, along with futuristic elements such as spacecraft, robots, cyborgs, interstellar travel or other technologies."},"Director":{"Name":"Steven Spielberg","Bio":"Spielberg loves sharks and aliens!","Birth":"1946"},"ImagePath":"Insert Image URL here","Featured":false,"Actors":"Drew Barrymore"}
{"_id":{"$oid":"5dd6b5e903b642d590c84022"},"Title":"Jaws","Description":"When a young woman is killed by a shark while skinny-dipping near the New England tourist town of Amity Island, police chief Martin Brody wants to close the beaches, but mayor Larry Vaughn overrules him, fearing that the loss of tourist revenue will cripple the town. Ichthyologist Matt Hooper and grizzled ship captain Quint offer to help Brody capture the killer beast, and the trio engage in an epic battle of man vs. nature..","Genre":{"Name":"Thriller","Description":"Thriller is a genre that revolves around anticipation and suspense. The aim for Thrillers is to keep the audience alert and on the edge of their seats. The protagonist in these films is set against a problem – an escape, a mission, or a mystery."},"Director":{"Name":"Steven Spielberg","Bio":"Spielberg loves sharks and aliens!","Birth":"1946"},"ImagePath":"Insert Image URL here","Featured":false,"Actors":"Robert Shaw"}
{"_id":{"$oid":"5dd6b69603b642d590c84023"},"Title":"Fight Club","Description":"A depressed man suffering from insomnia meets a strange soap salesman named Tyler Durden and soon finds himself living in his squalid house after his perfect apartment is destroyed. The two bored men form an underground club with strict rules and fight other men who are fed up with their mundane lives. Their perfect partnership frays when Marla, a fellow support group crasher, attracts Tyler's attention.","Genre":{"Name":"Psychological Thriller","Description":"Psychological thriller is a thriller narrative which emphasizes the unstable or delusional psychological states of its characters. ... Psychological thrillers often incorporate elements of mystery, drama, action, and paranoia."},"Director":{"Name":"David Fincher","Bio":"David Andrew Leo Fincher is an American film director, film producer, television director, television producer, and music video director. He was nominated for the Academy Award for Best Director for The Curious Case of Benjamin Button and The Social Network.","Birth":"1962"},"ImagePath":"Insert Image URL here","Featured":false,"Actors":["Brad Pitt","Edward Norton"]}
