{"_id":{"$oid":"5dd6b06e03b642d590c8401a"},"Title":"V for Vendetta","Description":"Following world war, London is a police state occupied by a fascist government, and a vigilante known only as V uses terrorist tactics to fight the oppressors of the world in which he now lives. When V saves a young woman named Evey from the secret police, he discovers an ally in his fight against England's oppressors.","Genre":{"Name":"Thriller","Description":"Thriller is a genre that revolves around anticipation and suspense. The aim for Thrillers is to keep the audience alert and on the edge of their seats. The protagonist in these films is set against a problem – an escape, a mission, or a mystery."},"Director":{"Name":"James McTeigue","Bio":"James McTeigue is an Australian film director. He has been an assistant director on many films, including Dark City, the Matrix trilogy and Star Wars: Episode II – Attack of the Clones, and made his directorial debut with the film V for Vendetta to critical acclaim. Since Vendetta he has collaborated with the Wachowskis an additional three times as director on The Invasion, Ninja Assassin and Sense8.","Birth":"1967"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/vForVendetta.jpg","Featured":true,"Actors":"Natalie Portman"}
{"_id":{"$oid":"5dd6b0ec03b642d590c8401b"},"Title":"Girl, Interrupted","Description":"Set in the changing world of the late 1960s, ‘Girl, Interrupted’ is the searing true story of Susanna Kaysen, a young woman who finds herself at a renowned mental institution for troubled young women, where she must choose between the world of people who belong on the inside -- like the seductive and dangerous Lisa -- or the often difficult world of reality on the outside.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"James Mangold","Bio":"James Mangold is an American film and television director, screenwriter and producer. He is best known for directing the films Logan, Cop Land, Girl, Interrupted, Kate \u0026 Leopold, Walk the Line, and 3:10 to Yuma.","Birth":"1963"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/girlInterrupted.jpg","Featured":false,"Actors":"Angelina Jolie"}
{"_id":{"$oid":"5dd6b15d03b642d590c8401c"},"Title":"The Mummy","Description":"Mummys are scary!","Genre":{"Name":"Action","Description":"Action films are a film genre where action sequences, such as fighting, stunts, car chases or explosions, take precedence over elements like characterization or complex plotting. The action typically involves individual efforts on the part of the hero, in contrast with most war films."},"Director":{"Name":"Stephen Sommers","Bio":"Stephen Sommers is an American film director and screenwriter, best known for big-budget movies, such as The Mummy, its sequel, The Mummy Returns, Van Helsing, and G.I. Joe: The Rise of Cobra.","Birth":"1962"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/theMummy.jpg","Featured":false,"Actors":["Brendan Fraser","Rachel Weisz"]}
{"_id":{"$oid":"5dd6b39a03b642d590c8401d"},"Title":"The Matrix","Description":"Neo believes that Morpheus, an elusive figure considered to be the most dangerous man alive, can answer his question -- What is the Matrix? Neo is contacted by Trinity, a beautiful stranger who leads him into an underworld where he meets Morpheus. They fight a brutal battle for their lives against a cadre of viciously intelligent secret agents. It is a truth that could cost Neo something more precious than his life.","Genre":{"Name":"Action","Description":"Action films are a film genre where action sequences, such as fighting, stunts, car chases or explosions, take precedence over elements like characterization or complex plotting. The action typically involves individual efforts on the part of the hero, in contrast with most war films."},"Director":{"Name":"The Wachowskis","Bio":"Lana Wachowski (born Laurence Wachowski) and Lilly Wachowski (born Andrew Paul Wachowski)are American film and television directors, writers and producers. The sisters are both trans women. Collectively known as the Wachowskis, they have worked as a writing and directing team through most of their professional film careers. They achieved fame with their second film The Matrix, a major box office success for which they won the Saturn Award for Best Director"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/theMatrix.jpg","Featured":false,"Actors":["Keanu Reeves","Carrie-Anne Moss"]}
{"_id":{"$oid":"5dd6b41b03b642d590c8401e"},"Title":"The Talented Mr. Ripley","Description":"To be young and carefree amid the blue waters and idyllic landscape of sun-drenched Italy in the late 1950s; that's la dolce vita Tom Ripley  craves- and Dickie Greenleaf leads. When Dickie's father asks Tom to bring his errant playboy son back home to America, Dickie and his beautiful expatriate girlfriend, Marge Sherwood, never suspect the dangerous extremes to which Ripley will go to make their lifestyle his own.","Genre":{"Name":"Thriller","Description":"Thriller is a genre that revolves around anticipation and suspense. The aim for Thrillers is to keep the audience alert and on the edge of their seats. The protagonist in these films is set against a problem – an escape, a mission, or a mystery."},"Director":{"Name":"Andrew Minghella","Bio":"Anthony Minghella, CBE was a British film director, playwright and screenwriter. He was chairman of the board of Governors at the British Film Institute between 2003 and 2007. He won the Academy Award for Best Director for The English Patient.","Birth":"1954"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/talentedMrRipley.jpg","Featured":false,"Actors":["Jude Law","Matt Damon"]}
{"_id":{"$oid":"5dd6b48b03b642d590c8401f"},"Title":"Any Given Sunday","Description":"Four years ago, DAmato's Miami Sharks were at the top. Now, his team is struggling with three consecutive losses, sliding attendance, and aging heroes, particularly 39-year-old quarterback Jack ‘Cap’ Rooney. Off the field, DAmato is struggling with a failed marriage and estranged children, and is on a collision course with Christina Pagniacci, the young president/co-owner of the Sharks organization.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Oliver Stone","Bio":"William Oliver Stone is an American filmmaker, director, writer and conspiracy theorist. He won an Academy Award for Best Adapted Screenplay as writer of Midnight Express, and wrote the acclaimed gangster movie Scarface.","Birth":"1946"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/anyGivenSunday.jpg","Featured":false,"Actors":"Dennis Quad"}
{"_id":{"$oid":"5dd6b51d03b642d590c84020"},"Title":"Anywhere But Here","Description":"In this adaptation of the Mona Simpson novel, single mother Adele August is bad with money, and even worse when it comes to making decisions. Her straight-laced daughter, Ann, is a successful high school student with Ivy League aspirations. When Adele decides to pack up and move the two of them from the Midwest to Beverly Hills, Calif., to pursue her dreams of Hollywood success, Ann grows frustrated with her mother's irresponsible and impulsive ways.","Genre":{"Name":"Comedy","Description":"A comedy film is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect. Films in this style traditionally have a happy ending (black comedy being an exception)."},"Director":{"Name":"Wayne Wang","Bio":"Wayne Wang is a Hong Kong-American director, producer, and screenwriter. Considered a pioneer of Asian-American cinema, he was one of the first Chinese-American filmmakers to gain a major foothold in Hollywood.","Birth":"1949"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/anywhereButHere.jpg","Featured":false,"Actors":["Susan Sarandon","Natalie Portman"]}
{"_id":{"$oid":"5dd6b59803b642d590c84021"},"Title":"E.T.","Description":"After a gentle alien becomes stranded on Earth, the being is discovered and befriended by a young boy named Elliott. Bringing the extraterrestrial into his suburban California house, Elliott introduces E.T., as the alien is dubbed, to his brother and his little sister, Gertie, and the children decide to keep its existence a secret. Soon, however, E.T. falls ill, resulting in government intervention and a dire situation for both Elliott and the alien.","Genre":{"Name":"Science Fiction","Description":"Science fiction film (or sci-fi film) is a genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, alien worlds, extrasensory perception and time travel, along with futuristic elements such as spacecraft, robots, cyborgs, interstellar travel or other technologies."},"Director":{"Name":"Steven Spielberg","Bio":"Spielberg loves sharks and aliens!","Birth":"1946"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/et.jpg","Featured":false,"Actors":"Drew Barrymore"}
{"_id":{"$oid":"5dd6b5e903b642d590c84022"},"Title":"Jaws","Description":"When a young woman is killed by a shark while skinny-dipping near the New England tourist town of Amity Island, police chief Martin Brody wants to close the beaches, but mayor Larry Vaughn overrules him, fearing that the loss of tourist revenue will cripple the town. Ichthyologist Matt Hooper and grizzled ship captain Quint offer to help Brody capture the killer beast, and the trio engage in an epic battle of man vs. nature..","Genre":{"Name":"Thriller","Description":"Thriller is a genre that revolves around anticipation and suspense. The aim for Thrillers is to keep the audience alert and on the edge of their seats. The protagonist in these films is set against a problem – an escape, a mission, or a mystery."},"Director":{"Name":"Steven Spielberg","Bio":"Spielberg loves sharks and aliens!","Birth":"1946"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/jaws.jpg","Featured":false,"Actors":"Robert Shaw"}
{"_id":{"$oid":"5dd6b69603b642d590c84023"},"Title":"Fight Club","Description":"A depressed man suffering from insomnia meets a strange soap salesman named Tyler Durden and soon finds himself living in his squalid house after his perfect apartment is destroyed. The two bored men form an underground club with strict rules and fight other men who are fed up with their mundane lives. Their perfect partnership frays when Marla, a fellow support group crasher, attracts Tyler's attention.","Genre":{"Name":"Psychological Thriller","Description":"Psychological thriller is a thriller narrative which emphasizes the unstable or delusional psychological states of its characters. ... Psychological thrillers often incorporate elements of mystery, drama, action, and paranoia."},"Director":{"Name":"David Fincher","Bio":"David Andrew Leo Fincher is an American film director, film producer, television director, television producer, and music video director. He was nominated for the Academy Award for Best Director for The Curious Case of Benjamin Button and The Social Network.","Birth":"1962"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/fightClub.jpg","Featured":false,"Actors":["Brad Pitt","Edward Norton"]}
{"_id":{"$oid":"5de32b1f26eee1442c596e78"},"Title":"Lord of the Rings:The Two Towers","Description":"The sequel to the Golden Globe-nominated and AFI Award-winning The Lord of the Rings: The Fellowship of the Ring,  The Two Towers follows the continuing quest of Frodo and the Fellowship to destroy the One Ring. Frodo and Sam discover they are being followed by the mysterious Gollum. Aragorn , the Elf archer Legolas and Gimli the Dwarf encounter the besieged Rohan kingdom, whose once great King Theoden has fallen under Saruman's deadly spell.","Genre":{"Name":"Adventure","Description":"Adventure films are a genre of film that typically use their action scenes to display and explore exotic locations in an energetic way."},"Director":{"Name":"Peter Jackson","Bio":"Sir Peter Robert Jackson is a New Zealand film director, screenwriter, and film producer. He is best known as the director, writer, and producer of the Lord of the Rings trilogy and the Hobbit trilogy, both of which are adapted from the novels of the same name by J. R. R. Tolkien.","Birth":"1961"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/LOTRTwoTowers.jpg","Featured":false,"Actors":"Christopher Lee"}
{"_id":{"$oid":"5de32d2b26eee1442c596e79"},"Title":"A Midsummer Night’s Dream","Description":"This version of the renowned comedic play finds the world of humans intersecting with the realm of magic. The lovely Hermia is to wed Demetrius, but she truly cares for Lysander (Dominic West). Hermia's friend, Helena, is in love with Demetrius, while other romantic entanglements abound in the woods, with married fairy rulers Titania and Oberon toying with various lovers and each other.","Genre":{"Name":"Comedy","Description":"A comedy film is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect. Films in this style traditionally have a happy ending (black comedy being an exception)."},"Director":{"Name":"Michael Hoffman","Bio":"Michael Lynn Hoffman is an American film director.","Birth":"1956"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/aMidsummersNightDream.jpg","Featured":false,"Actors":["Michelle Pfeiffer","Kevin Kline"]}
{"_id":{"$oid":"5de32df026eee1442c596e7a"},"Title":"A Quiet Place","Description":"If they hear you, they hunt you. A family must live in silence to avoid mysterious creatures that hunt by sound. Knowing that even the slightest whisper or footstep can bring death, Evelyn and Lee are determined to find a way to protect their children while desperately searching for a way to fight back.","Genre":{"Name":"Horror","Description":"A horror film is a film that seeks to elicit fear for entertainment purposes. Initially inspired by literature from authors like Edgar Allan Poe, Bram Stoker, and Mary Shelley, horror has existed as a film genre for more than a century. The macabre and the supernatural are frequent themes."},"Director":{"Name":"John Krasinski","Bio":"John Burke Krasinski is an American actor and filmmaker. Besides appearing in and making feature films, he is known for his role as Jim Halpert on the NBC sitcom The Office. He also served as a producer and occasional director of the series throughout its nine-season run.","Birth":"1979"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/aQuietPlace.jpg","Featured":false,"Actors":"John Krasinski"}
{"_id":{"$oid":"5de3310c26eee1442c596e7b"},"Title":"Lemony Snicket's A Series of Unfortunate Events","Description":"After the three young Baudelaire siblings are left orphaned by a fire in their mansion, they are carted off to live with their distant relative, Count Olaf. Unfortunately, Olaf is a cruel, scheming man only after the inheritance that the eldest Baudelaire, Violet, is set to receive. The children escape and find shelter with their quirky Uncle Monty and, subsequently, their phobic Aunt Josephine, but Olaf is never far behind.","Genre":{"Name":"Adventure","Description":"Adventure films are a genre of film that typically use their action scenes to display and explore exotic locations in an energetic way."},"Director":{"Name":"Brad Silberling","Bio":"Bradley Mitchell Silberling is an American television and film director known for directing feature films such as Casper, City of Angels, Lemony Snicket's A Series of Unfortunate Events and Land of the Lost.","Birth":"1963"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/aSeriesOfUnfortunateEvents.jpg","Featured":false,"Actors":"Jim Carrey"}
{"_id":{"$oid":"5de3335326eee1442c596e7c"},"Title":"A.I. Artificial Intelligence","Description":"A robotic boy, the first programmed to love, David is adopted as a test case by a Cybertronics employee and his wife. Though he gradually becomes their child, a series of unexpected circumstances make this life impossible for David. Without final acceptance by humans or machines, David embarks on a journey to discover where he truly belongs, uncovering a world in which the line between robot and machine is both vast and profoundly thin.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Steven Spielberg","Bio":"Steven Allan Spielberg KBE is an American filmmaker. He is considered one of the founding pioneers of the New Hollywood era and one of the most popular directors and producers in film history. Spielberg started in Hollywood directing television and several minor theatrical releases.","Birth":"1946"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/aiArtificalIntelligence.jpg","Featured":false,"Actors":["Haley Joel Osment","Frances O'Connor"]}
{"_id":{"$oid":"5de334b726eee1442c596e7e"},"Title":"American Beauty","Description":"A telesales operative becomes disillusioned with his existence and begins to hunger for fresh excitement in his life. As he experiences a new awakening of the senses, his wife and daughter also undergo changes that seriously affect their family. Critically acclaimed, this film won Oscars for Best Screenplay, Best Director, Best Actor and Best Film.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Sam Mendes","Bio":"Samuel Alexander Mendes CBE is an English film director, film producer, screenwriter, and stage director best known for his directoral debut film American Beauty, which earned him the Academy Award and Golden Globe Award for Best Director, the crime film Road to Perdition, and the James Bond films Skyfall and Spectre.","Birth":"1965"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/americanBeauty.jpg","Featured":false,"Actors":"Annette Bening"}
{"_id":{"$oid":"5de334b726eee1442c596e7f"},"Title":"Austin Powers: The Spy Who Shagged Me","Description":"In his second screen adventure, British super spy Austin Powers must return to 1969, as arch-nemesis Dr. Evil has ventured back to that year and successfully stolen Austin's ‘mojo’ and set up a powerful laser and aimed it at Earth. With the help of gorgeous agent Felicity Shagwell, the newly single Austin must now not only contend with Dr. Evil, but also Evil's vicious, pint-size attack-clone, Mini-Me..","Genre":{"Name":"Comedy","Description":"A comedy film is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect. Films in this style traditionally have a happy ending (black comedy being an exception)."},"Director":{"Name":"Jay Roach","Bio":"Mathew Jay Roach is an American film director, producer, and screenwriter, best known for directing the Austin Powers films and Meet the Parents. He also directed the comedy film Dinner for Schmucks, the HBO political dramas Recount, Game Change and All the Way, and the political comedy The Campaign. ","Birth":"1957"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/austinPowers.jpg","Featured":false,"Actors":["Heather Graham","Will Ferrell"]}
{"_id":{"$oid":"5de3368c26eee1442c596e80"},"Title":"Avengers: Age of Ultron","Description":"When Tony Stark jump-starts a dormant peacekeeping program, things go terribly awry, forcing him, Thor, the Incredible Hulk and the rest of the Avengers to reassemble. As the fate of Earth hangs in the balance, the team is put to the ultimate test as they battle Ultron, a technological terror hell-bent on human extinction. Along the way, they encounter two mysterious and powerful newcomers, Pietro and Wanda Maximoff.","Genre":{"Name":"Action","Description":"Action films are a film genre where action sequences, such as fighting, stunts, car chases or explosions, take precedence over elements like characterization or complex plotting. The action typically involves individual efforts on the part of the hero, in contrast with most war films."},"Director":{"Name":"Joss Whedon","Bio":"Joseph Hill Whedon is an American producer, director, screenwriter, comic book writer, and composer.","Birth":"1964"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/avengersAgeOfUltron.jpg","Featured":false,"Actors":"Robert Downey Jr"}
{"_id":{"$oid":"5de3368c26eee1442c596e81"},"Title":"Batman","Description":"Having witnessed his parents' brutal murder as a child, millionaire philanthropist Bruce Wayne fights crime in Gotham City disguised as Batman, a costumed hero who strikes fear into the hearts of villains. But when a deformed madman who calls himself ‘The Joker’ seizes control of Gotham's criminal underworld, Batman must face his most ruthless nemesis ever while protecting both his identity and his love interest, reporter Vicki Vale.","Genre":{"Name":"Action","Description":"Action films are a film genre where action sequences, such as fighting, stunts, car chases or explosions, take precedence over elements like characterization or complex plotting. The action typically involves individual efforts on the part of the hero, in contrast with most war films."},"Director":{"Name":"Tim Burton","Bio":"Timothy Walter Burton is an American director, producer, artist, writer, and animator. He is known for his dark, gothic, and eccentric horror and fantasy films such as Beetlejuice, Batman, and Edward Scissorhands. ","Birth":"1958"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/batman.jpg","Featured":false,"Actors":"Michael Keaton"}
{"_id":{"$oid":"5de3395126eee1442c596e82"},"Title":"Being John Malkovich","Description":"In this quirky cult-favorite comedy, unemployed New York City puppeteer Craig Schwartz reluctantly takes a temp job as a filing clerk for the eccentric Dr. Lester. While at work, Craig discovers a portal that leads into the mind of renowned actor John Malkovich. When he lets his attractive co-worker Maxine in on the secret, they begin both an unusual business scheme and an odd relationship that involves Craig's restless wife, Lotte .","Genre":{"Name":"Comedy","Description":"A comedy film is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect. Films in this style traditionally have a happy ending (black comedy being an exception)."},"Director":{"Name":"Spike Jonze","Bio":"Adam Spiegel, known professionally as Spike Jonze, is an American filmmaker, photographer, and actor, whose work includes music videos, commercials, film and television.","Birth":"1969"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/beingJohnMalkovich.jpg","Featured":false,"Actors":["John Malkovich","Catherine Keener"]}
{"_id":{"$oid":"5de3395126eee1442c596e83"},"Title":"Big Daddy","Description":"Thirty-two-year-old Sonny Koufax has spent his whole life avoiding responsibility. But when his girlfriend dumps him for an older man, he's got to find a way to prove he's ready to grow up. In a desperate last-ditch effort, Sonny adopts 5-year-old Julian to impress her. She's not impressed ... and he can't return the kid. Uh-oh for Sonny!","Genre":{"Name":"Comedy","Description":"A comedy film is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect. Films in this style traditionally have a happy ending (black comedy being an exception)."},"Director":{"Name":"Dennis Dugan","Bio":"Dennis Barton Dugan is an American director, actor, writer, artist and comedian. He is known for his partnership with comedic actor Adam Sandler, with whom he directed the films such as Happy Gilmore, Big Daddy, and Grown Ups","Birth":"1946"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/bigDaddy.jpg","Featured":false,"Actors":"Adam Sandler"}
{"_id":{"$oid":"5de3395126eee1442c596e84"},"Title":"Blade Runner 2049","Description":"Officer K, a new blade runner for the Los Angeles Police Department, unearths a long-buried secret that has the potential to plunge what's left of society into chaos. His discovery leads him on a quest to find Rick Deckard, a former blade runner who's been missing for 30 years.","Genre":{"Name":"Action","Description":"Action films are a film genre where action sequences, such as fighting, stunts, car chases or explosions, take precedence over elements like characterization or complex plotting. The action typically involves individual efforts on the part of the hero, in contrast with most war films."},"Director":{"Name":"Denis Villeneuve","Bio":"Denis Villeneuve is a French Canadian film director, writer, and producer. He is a four-time recipient of the Canadian Screen Award for Best Direction, for Maelström in 2001, Polytechnique in 2009, Incendies in 2011 and Enemy in 2014.","Birth":"1967"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/bladeRunner.jpg","Featured":false,"Actors":["Ryan Gosling","Ana de Armas"]}
{"_id":{"$oid":"5de33be126eee1442c596e85"},"Title":"The Blair Witch Project","Description":"Found video footage tells the tale of three film students who've traveled to a small town to collect documentary footage about the Blair Witch, a legendary local murderer. Over the course of several days, the students interview townspeople and gather clues to support the tale's veracity. But the project takes a frightening turn when the students lose their way in the woods and begin hearing horrific noises.","Genre":{"Name":"Horror","Description":"A horror film is a film that seeks to elicit fear for entertainment purposes. Initially inspired by literature from authors like Edgar Allan Poe, Bram Stoker, and Mary Shelley, horror has existed as a film genre for more than a century. The macabre and the supernatural are frequent themes."},"Director":{"Name":"Eduardo Sánchez","Bio":"Eduardo Miguel Sánchez-Quiros is a Cuban-born American director, most famous for co-directing and writing the 1999 psychological horror The Blair Witch Project with Daniel Myrick.","Birth":"1968"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/blairWitchProject.jpg","Featured":false}
{"_id":{"$oid":"5de33be126eee1442c596e86"},"Title":"Blazing Saddles","Description":"In this satirical take on Westerns, crafty railroad worker Bart becomes the first black sheriff of Rock Ridge, a frontier town about to be destroyed in order to make way for a new railroad. Initially, the people of Rock Ridge harbor a racial bias toward their new leader. However, they warm to him after realizing that Bart and his perpetually drunk gunfighter friend are the only defense against a wave of thugs sent to rid the town of its population.","Genre":{"Name":"Comedy","Description":"A comedy film is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect. Films in this style traditionally have a happy ending (black comedy being an exception)."},"Director":{"Name":"Mel Brooks","Bio":"Mel Brooks is an American director, writer, actor, comedian, producer and composer. He is known as a creator of broad film farces and comedic parodies. Brooks began his career as a comic and a writer for the early TV variety show Your Show of Shows.","Birth":"1926"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/blazingSaddles.jpg","Featured":false,"Actors":["Gene Wilder","Cleavon Little"]}
{"_id":{"$oid":"5de33be126eee1442c596e87"},"Title":"Blue Streak","Description":"When a heist goes wrong, thief Miles hides a diamond at a construction site before he's arrested. After serving two years, Miles returns to the location of his treasure and finds it is now a police station. Disguising himself as a recently transferred officer to infiltrate the building, Miles stops an escaping thief while trying to retrieve the jewel. Impressed by his quick action, superior Rizzo partners him with the bumbling detective Casey.","Genre":{"Name":"Comedy","Description":"A comedy film is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect. Films in this style traditionally have a happy ending (black comedy being an exception)."},"Director":{"Name":"Les Mayfield","Bio":"Les Mayfield is an American film director and producer.","Birth":"1959"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/blueStreak.jpg","Featured":false,"Actors":"Martin Lawerence"}
{"_id":{"$oid":"5de3404826eee1442c596e88"},"Title":"Catch Me If You Can ","Description":"Frank Abagnale, Jr.  worked as a doctor, a lawyer, and as a co-pilot for a major airline -- all before his 18th birthday. A master of deception, he was also a brilliant forger, whose skill gave him his first real claim to fame: At the age of 17, Frank Abagnale, Jr. became the most successful bank robber in the history of the U.S. FBI Agent Carl Hanratty makes it his prime mission to capture Frank and bring him to justice, but Frank is always one step ahead of him.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Steven Spielberg","Bio":"Steven Allan Spielberg KBE is an American filmmaker. He is considered one of the founding pioneers of the New Hollywood era and one of the most popular directors and producers in film history. Spielberg started in Hollywood directing television and several minor theatrical releases. ","Birth":"1946"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/catchMeIfYouCan.jpg","Featured":false,"Actors":"Leonardo DiCaprio"}
{"_id":{"$oid":"5de3404826eee1442c596e89"},"Title":"The Cider House Rules","Description":"A young man is taught medicine by the doctor at the orphanage where he was brought up. However, when he clashes with his mentor over the issue of abortion, he leaves the home and finds work on a cider farm. There he falls in love with another man's girlfriend but starts to re-evaluate his principles when one of the farm workers becomes pregnant by her own father.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Lasse Hallström","Bio":"Lars Sven ‘Lasse’ Hallström is a Swedish film director. He first became known for directing almost all music videos by pop group ABBA, and subsequently became a feature film director. He was nominated for an Academy Award for Best Director for My Life as a Dog and later for The Cider House Rules.","Birth":"1946"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/ciderHouseRules.jpg","Featured":false,"Actors":["Michael Caine","Tobey Maguire"]}
{"_id":{"$oid":"5de3404826eee1442c596e8a"},"Title":"Close Encounters of the Third Kind","Description":"Science fiction adventure about a group of people who attempt to contact alien intelligence. Roy Neary witnesses an unidentified flying object, and even has a ‘sunburn’ from its bright lights to prove it. Roy refuses to accept an explanation for what he saw and is prepared to give up his life to pursue the truth about UFOs.","Genre":{"Name":"Science Fiction","Description":"Science fiction film (or sci-fi film) is a genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, alien worlds, extrasensory perception and time travel, along with futuristic elements such as spacecraft, robots, cyborgs, interstellar travel or other technologies."},"Director":{"Name":"Steven Spielberg","Bio":"Steven Allan Spielberg KBE is an American filmmaker. He is considered one of the founding pioneers of the New Hollywood era and one of the most popular directors and producers in film history. Spielberg started in Hollywood directing television and several minor theatrical releases.","Birth":"1946"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/closeEncountersOfTheThirdKind.jpg","Featured":false,"Actors":"Richard Dreyfuss"}
{"_id":{"$oid":"5de3434026eee1442c596e8b"},"Title":"Black Panther","Description":"After the death of his father, T'Challa returns home to the African nation of Wakanda to take his rightful place as king. When a powerful enemy suddenly reappears, T'Challa's mettle as king -- and as Black Panther -- gets tested when he's drawn into a conflict that puts the fate of Wakanda and the entire world at risk. Faced with treachery and danger, the young king must rally his allies and release the full power of Black Panther to defeat his foes and secure the safety of his people.","Genre":{"Name":"Action","Description":"Action films are a film genre where action sequences, such as fighting, stunts, car chases or explosions, take precedence over elements like characterization or complex plotting. The action typically involves individual efforts on the part of the hero, in contrast with most war films."},"Director":{"Name":"Ryan Coogler","Bio":"Ryan Kyle Coogler is an American film director, producer, and screenwriter. His first feature film, Fruitvale Station, won the top audience and grand jury awards in the U.S. dramatic competition at the 2013 Sundance Film Festival. ","Birth":"1986"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/darkPanther.jpg","Featured":false,"Actors":"Chadwick Boseman"}
{"_id":{"$oid":"5de3434026eee1442c596e8c"},"Title":"Deep Blue Sea","Description":"On an island research facility, Dr. Susan McAlester is harvesting the brain tissue of DNA-altered sharks as a possible cure for Alzheimer's disease. When the facility's backers send an executive to investigate the experiments, a routine procedure goes awry and a shark starts attacking the researchers. Now, with sharks outnumbering their human captors, McAlester and her team must figure out a way to stop them from escaping to the ocean and breeding.","Genre":{"Name":"Action","Description":"Action films are a film genre where action sequences, such as fighting, stunts, car chases or explosions, take precedence over elements like characterization or complex plotting. The action typically involves individual efforts on the part of the hero, in contrast with most war films."},"Director":{"Name":"Renny Harlin","Bio":"Renny Harlin is a Finnish film director, producer and screenwriter. His films include A Nightmare on Elm Street 4: The Dream Master, Die Hard 2, Cliffhanger, The Long Kiss Goodnight, Deep Blue Sea and Devil's Pass.","Birth":"1959"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/deepBlueSea.jpg","Featured":false,"Actors":"Stellan Skarsgård"}
{"_id":{"$oid":"5de3434026eee1442c596e8d"},"Title":"Dogma","Description":"Two fallen angels who were ejected from paradise find themselves banned in Wisconsin. They are now headed for New Jersey where they find a loophole that can get them back into heaven. The only catch is that it will destroy humanity. A group bands together to stop them.","Genre":{"Name":"Comedy","Description":"A comedy film is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect. Films in this style traditionally have a happy ending (black comedy being an exception)."},"Director":{"Name":"Kevin Smith","Bio":"Kevin Patrick Smith is an American filmmaker, actor, comedian, public speaker, comic book writer, author, and podcaster. He came to prominence with the low-budget comedy film Clerks, which he wrote, directed, co-produced, and acted in as the character Silent Bob of stoner duo Jay and Silent Bob.","Birth":"1970"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/dogma.jpg","Featured":false,"Actors":"Alan Rickman"}
{"_id":{"$oid":"5de3e6d426eee1442c596e8e"},"Title":"Domino ","Description":"In this film loosely based on a true story, Domino Harvey, a former model, is now a bounty hunter who has been arrested for robbing an armored car. During interrogation, she claims innocence and tells her story. Harvey became a pupil of Ed Moseby, who ran a course for aspiring bounty hunters. Along with Choco, the three of them became a successful team. But, when a bail bondsman offered a job, they faced a complicated frame-up.","Genre":{"Name":"Action","Description":"Action films are a film genre where action sequences, such as fighting, stunts, car chases or explosions, take precedence over elements like characterization or complex plotting. The action typically involves individual efforts on the part of the hero, in contrast with most war films."},"Director":{"Name":"Tony Scott","Bio":"Anthony David Leighton Scott was an English film director, producer and screenwriter. He was known for directing action and thriller films such as Top Gun, Beverly Hills Cop II, The Last Boy Scout, True Romance, Crimson Tide, Enemy of the State, Man on Fire, Déjà Vu, and Unstoppable.","Birth":"1944","Death":"2012"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/domino.jpg","Featured":false,"Actors":"Keira Knightley"}
{"_id":{"$oid":"5de3e6f426eee1442c596e8f"},"Title":"Doctor Strange","Description":"Dr. Stephen Strange's life changes after a car accident robs him of the use of his hands. When traditional medicine fails him, he looks for healing, and hope, in a mysterious enclave. He quickly learns that the enclave is at the front line of a battle against unseen dark forces bent on destroying reality. Before long, Strange is forced to choose between his life of fortune and status or leave it all behind to defend the world as the most powerful sorcerer in existence.","Genre":{"Name":"Action","Description":"Action films are a film genre where action sequences, such as fighting, stunts, car chases or explosions, take precedence over elements like characterization or complex plotting. The action typically involves individual efforts on the part of the hero, in contrast with most war films."},"Director":{"Name":"Scott Derrickson","Bio":"Scott Derrickson is an American film director, producer, and screenwriter. He lives in Los Angeles, California. Derrickson is best known for directing The Exorcism of Emily Rose, Sinister, and the Marvel Cinematic Universe superhero film Doctor Strange.","Birth":"1966"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/drStrange.jpg","Featured":false,"Actors":"Benedict Cumberbatch"}
{"_id":{"$oid":"5de3e72026eee1442c596e90"},"Title":"Dudley Do-Right","Description":"Based on the cartoon, this live-action comedy follows the adventures of Dudley Do-Right, an enthusiastic, if somewhat dim, Canadian Mountie. When Dudley's childhood crush, Nell Fenwick, returns to their hometown in the mountains, he is eager to spend time with her, but his attempts at courting her are foiled by the villainous Snidely Whiplash, who is up to his usual schemes. Can Dudley win Nell's heart and curtail Snidely's wicked ways?","Genre":{"Name":"Comedy","Description":"A comedy film is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect. Films in this style traditionally have a happy ending (black comedy being an exception)."},"Director":{"Name":"Hugh Wilson","Bio":"Hugh Hamilton Wilson Jr. was an American film director, writer and television showrunner. He is best known as the creator of the TV series WKRP in Cincinnati and Frank's Place, and as the director of the film comedies Police Academy and The First Wives Club.","Birth":"1943","Death":"2018"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/dudleyDoRight.jpg","Featured":false,"Actors":"Brendan Fraser"}
{"_id":{"$oid":"5de3eac926eee1442c596e91"},"Title":"Freddy vs. Jason","Description":"Two horror icons face off in this supernatural movie. Disfigured serial killer Freddy Krueger, who attacks his victims in their dreams, has lost much of his power since citizens of his town have become less afraid of him. Enlisting the help of fellow violent murderer Jason Voorhees , Freddy orchestrates a new killing spree. However, when the hockey-mask-wearing psychopath won't stop chopping up Freddy's intended victims, the two ghouls start to battle each other.","Genre":{"Name":"Horror","Description":"A horror film is a film that seeks to elicit fear for entertainment purposes. Initially inspired by literature from authors like Edgar Allan Poe, Bram Stoker, and Mary Shelley, horror has existed as a film genre for more than a century. The macabre and the supernatural are frequent themes."},"Director":{"Name":"Ronny Yu","Bio":"Ronny Yu Yan-Tai is a Hong Kong film director, producer, and movie writer. He has worked on both Hong Kong and American films. He is mostly known for his work in the American horror genre, such as Bride of Chucky and Freddy vs. Jason.","Birth":"1950"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/freddyVsJason.jpg","Featured":false,"Actors":["Robert Englund","Ken Kirzinger"]}
{"_id":{"$oid":"5de3eac926eee1442c596e92"},"Title":"Godzilla","Description":"Ford Brody, a Navy bomb expert, has just reunited with his family in San Francisco when he is forced to go to Japan to help his estranged father, Joe. Soon, both men are swept up in an escalating crisis when Godzilla, King of the Monsters, arises from the sea to combat malevolent adversaries that threaten the survival of humanity. The creatures leave colossal destruction in their wake, as they make their way toward their final battleground, San Francisco.","Genre":{"Name":"Action","Description":"Action films are a film genre where action sequences, such as fighting, stunts, car chases or explosions, take precedence over elements like characterization or complex plotting. The action typically involves individual efforts on the part of the hero, in contrast with most war films."},"Director":{"Name":"Gareth Edwards","Bio":"Gareth James Edwards is an English film director, film producer, screenwriter, cinematographer, production designer, and visual effects artist. He first gained widespread recognition for Monsters, an independent film in which he served as writer, director, cinematographer, and visual effects artist.","Birth":"1975"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/godzilla.jpg","Featured":false}
{"_id":{"$oid":"5de3edce26eee1442c596e93"},"Title":"Harry Potter and the Order of the Phoenix","Description":"Now in his fifth year at Hogwarts, Harry learns that many in the wizarding community do not know the truth of his encounter with Lord Voldemort. Cornelius Fudge, minister of Magic, appoints his toady, Dolores Umbridge, as Defense Against the Dark Arts teacher, for he fears that professor Dumbledore will take his job. But her teaching is deficient and her methods, cruel, so Harry prepares a group of students to defend the school against a rising tide of evil.","Genre":{"Name":"Adventure","Description":"Adventure films are a genre of film that typically use their action scenes to display and explore exotic locations in an energetic way."},"Director":{"Name":"David Yates","Bio":"David Yates is an English filmmaker who has directed films, short films, and television productions. Yates directed the final four films in the Harry Potter series.","Birth":"1963"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/harryPotterAndTheOrderOfThePhoenix.jpg","Featured":false,"Actors":"Gary Oldman"}
{"_id":{"$oid":"5de3edce26eee1442c596e94"},"Title":"Hellboy","Description":"While battling a trio of rampaging giants, the legendary half-demon Hellboy encounters Nimue the Blood Queen, an ancient resurrected sorceress who's out to avenge a past betrayal. Suddenly caught in a clash between the supernatural and the human, Hellboy soon becomes hell-bent on stopping Nimue without triggering the end of the world.","Genre":{"Name":"Action","Description":"Action films are a film genre where action sequences, such as fighting, stunts, car chases or explosions, take precedence over elements like characterization or complex plotting. The action typically involves individual efforts on the part of the hero, in contrast with most war films."},"Director":{"Name":"Neil Marshall","Bio":"Neil Marshall is an English film director, editor and screenwriter. Marshall began his career in editing; the 2002 horror-comedy Dog Soldiers was his directorial debut, which became a cult film. He followed up with the critically acclaimed horror film The Descent in 2005.","Birth":"1970"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/hellboy.jpg","Featured":false,"Actors":"Ron Perlman"}
{"_id":{"$oid":"5de3edce26eee1442c596e95"},"Title":"Indiana Jones and the Kingdom of the Crystal Skull","Description":"It's the height of the Cold War, and famous archaeologist Indiana Jones, returning from his latest adventure, finds out his job at Marshall College is in jeopardy. He meets Mutt, a young man who wants Indy to help him find the legendary Crystal Skull of Akator, and the pair set out for Peru. However, deadly agent Irina Spalko is searching for the powerful artifact, too, because the Soviets believe it can help them conquer the world.","Genre":{"Name":"Action","Description":"Action films are a film genre where action sequences, such as fighting, stunts, car chases or explosions, take precedence over elements like characterization or complex plotting. The action typically involves individual efforts on the part of the hero, in contrast with most war films."},"Director":{"Name":"Steven Spielberg","Bio":"Steven Allan Spielberg KBE is an American filmmaker. He is considered one of the founding pioneers of the New Hollywood era and one of the most popular directors and producers in film history. Spielberg started in Hollywood directing television and several minor theatrical releases.","Birth":"1946"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/indianaJonesAndTheKingdomOfTheCrystalSkull.jpg","Featured":false,"Actors":"Cate Blanchett"}
{"_id":{"$oid":"5de3eff826eee1442c596e96"},"Title":"Iron Giant","Description":"In this animated adaptation of Ted Hughes' Cold War fable, a giant alien robot crash-lands near the small town of Rockwell, Maine, in 1957. Exploring the area, a local 9-year-old boy, Hogarth, discovers the robot, and soon forms an unlikely friendship with him. When a paranoid government agent, Kent Mansley, becomes determined to destroy the robot, Hogarth and beatnik Dean McCoppin must do what they can to save the misunderstood machine.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Brad Bird","Bio":"Phillip Bradley Bird is an American animator, director, screenwriter, producer, and voice actor best known for his animated feature films The Iron Giant, The Incredibles, Ratatouille, and Incredibles 2. His live action films are Mission Impossible – Ghost Protocol and Tomorrowland.","Birth":"1957"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/ironGiant.jpg","Featured":false,"Actors":"Vin Diesel"}
{"_id":{"$oid":"5de3eff826eee1442c596e97"},"Title":"Jurassic Park","Description":"In Steven Spielberg's massive blockbuster, paleontologists, Alan Grant and Ellie Sattler and mathematician, Ian Malcolm are among a select group chosen to tour an island theme park populated by dinosaurs created from prehistoric DNA. While the park's mastermind, billionaire John Hammond, assures everyone that the facility is safe, they find out otherwise when various ferocious predators break free and go on the hunt.","Genre":{"Name":"Action","Description":"Action films are a film genre where action sequences, such as fighting, stunts, car chases or explosions, take precedence over elements like characterization or complex plotting. The action typically involves individual efforts on the part of the hero, in contrast with most war films."},"Director":{"Name":"Steven Spielberg","Bio":"Steven Allan Spielberg KBE is an American filmmaker. He is considered one of the founding pioneers of the New Hollywood era and one of the most popular directors and producers in film history. Spielberg started in Hollywood directing television and several minor theatrical releases.","Birth":"1946"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/jurrasicPark.jpg","Featured":false}
{"_id":{"$oid":"5de3eff826eee1442c596e98"},"Title":"Lincoln","Description":"With the nation embroiled in still another year with the high death count of Civil War, President Abraham Lincoln brings the full measure of his passion, humanity and political skill to what would become his defining legacy, to end the war and permanently abolish slavery through the 13th Amendment. Having great courage, acumen and moral fortitude, Lincoln pushes forward to compel the nation, and those in government who oppose him, to aim toward a greater good for all mankind.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Steven Spielberg","Bio":"Steven Allan Spielberg KBE is an American filmmaker. He is considered one of the founding pioneers of the New Hollywood era and one of the most popular directors and producers in film history. Spielberg started in Hollywood directing television and several minor theatrical releases.","Birth":"1946"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/lincoln.jpg","Featured":false,"Actors":"Daniel Day Lewis"}
{"_id":{"$oid":"5de3f1a526eee1442c596e99"},"Title":"Lost In Translation","Description":"A lonely, aging movie star named Bob Harris and a conflicted newlywed, Charlotte, meet in Tokyo. Bob is there to film a Japanese whiskey commercial; Charlotte is accompanying her celebrity-photographer husband. Strangers in a foreign land, the two find escape, distraction and understanding amidst the bright Tokyo lights after a chance meeting in the quiet lull of the hotel bar. They form a bond that is as unlikely as it is heartfelt and meaningful.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Sofia Coppola","Bio":"Sofia Carmina Coppola is an American screenwriter, director, producer, and former actress. The daughter of filmmakers Eleanor and Francis Ford Coppola, she made her film debut as an infant in her father's acclaimed crime drama film, The Godfather.","Birth":"1971"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/lostInTranslation.jpg","Featured":false,"Actors":["Scarlett Johansson","Bill Murray"]}
{"_id":{"$oid":"5de3f1a526eee1442c596e9a"},"Title":"The Lost World: Jurassic Park","Description":"John Hammond  summons chaos theorist Ian Malcolm to his home with some startling information -- while nearly everything at his Jurassic Park had been destroyed, his engineers happened to have a second site, where other dinosaurs were kept in hiding. It seems the dinosaurs on the second island are alive and well and even breeding; and Hammond wants Malcolm to observe and document the reptiles before Hammond's financiers can get to them.","Genre":{"Name":"Action","Description":"Action films are a film genre where action sequences, such as fighting, stunts, car chases or explosions, take precedence over elements like characterization or complex plotting. The action typically involves individual efforts on the part of the hero, in contrast with most war films."},"Director":{"Name":"Steven Spielberg","Bio":"Steven Allan Spielberg KBE is an American filmmaker. He is considered one of the founding pioneers of the New Hollywood era and one of the most popular directors and producers in film history. Spielberg started in Hollywood directing television and several minor theatrical releases.","Birth":"1946"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/lostWorld.jpg","Featured":false}
{"_id":{"$oid":"5de3f1a526eee1442c596e9b"},"Title":"Magnolia","Description":"On one random day in the San Fernando Valley, a dying father, a young wife, a male caretaker, a famous lost son, a police officer in love, a boy genius, an ex-boy genius, a game show host and an estranged daughter will each become part of a dazzling multiplicity of plots, but one story.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Paul Thomas Anderson","Bio":"Paul Thomas Anderson is an American filmmaker. His films have been nominated for 25 Academy Awards, winning three for cast and crew. An alumnus of the Sundance Institute, Anderson directed his first feature film, Hard Eight, in 1996.","Birth":"1970"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/magnolia.jpg","Featured":false,"Actors":"Tom Cruise"}
{"_id":{"$oid":"5de3f57d26eee1442c596e9c"},"Title":"Man on the Moon","Description":"Jim Carrey stars as the late Andy Kaufman, who was considered one of the most innovative, eccentric and enigmatic performers of his time. A master at manipulating audiences, Kaufman could generate belly laughs, stony silence, tears or brawls. Whether inviting the audience out for milk and cookies or challenging women to inter-gender wrestling matches, he specialized in creating performances so real that even his close friends were never sure where the truth lay.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Miloš Forman","Bio":"Jan Tomáš Miloš Forman was a Czech film director, screenwriter, actor, and professor who lived and worked primarily in Czechoslovakia until 1968. Forman was an important figure in the Czechoslovak New Wave.","Birth":"1932","Death":2018.0},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/manOnTheMoon.jpg","Featured":false,"Actors":"Jim Carrey"}
{"_id":{"$oid":"5de3f57d26eee1442c596e9d"},"Title":"Minority Report","Description":"Based on a story by famed science fiction writer Philip K. Dick, ‘Minority Report’ is an action-detective thriller set in Washington D.C. in 2054, where police utilize a psychic technology to arrest and convict murderers before they commit their crime. Tom Cruise plays the head of this Precrime unit and is himself accused of the future murder of a man he hasn't even met.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Steven Spielberg","Bio":"Steven Allan Spielberg KBE is an American filmmaker. He is considered one of the founding pioneers of the New Hollywood era and one of the most popular directors and producers in film history. Spielberg started in Hollywood directing television and several minor theatrical releases.","Birth":"1946"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/minorityReport.jpg","Featured":false,"Actors":"Tom Cruise"}
{"_id":{"$oid":"5de3f57d26eee1442c596e9e"},"Title":"Mission Impossible","Description":"When U.S. government operative Ethan Hunt and his mentor, Jim Phelps , go on a covert assignment that takes a disastrous turn, Jim is killed, and Ethan becomes the prime murder suspect. Now a fugitive, Hunt recruits brilliant hacker Luther Stickell and maverick pilot Franz Krieger to help him sneak into a heavily guarded CIA building to retrieve a confidential computer file that will prove his innocence.","Genre":{"Name":"Action","Description":"Action films are a film genre where action sequences, such as fighting, stunts, car chases or explosions, take precedence over elements like characterization or complex plotting. The action typically involves individual efforts on the part of the hero, in contrast with most war films."},"Director":{"Name":"Brian De Palma","Bio":"Brian Russell De Palma is an American film director and screenwriter. With a career spanning over 50 years, he is best known for his work in the suspense, psychological thriller, and crime drama genres.","Birth":"1940"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/missionImpossible.jpg","Featured":false,"Actors":"Tom Cruise"}
{"_id":{"$oid":"5de3f76726eee1442c596e9f"},"Title":"Moulin Rouge!","Description":"A young Englishman in the Paris of 1899, becomes infatuated with Satine, a singer at the Moulin Rouge. However, she has been promised by the manager to a Duke in return for funding his next production. As the young lovers meet in secret, Satine's wedding day draws closer but she hides a fatal secret from both Christian and the Duke","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Baz Luhrmann","Bio":"Baz Luhrmann is an Australian writer, director, and producer with projects spanning film, television, opera, theatre, music, and recording industries.","Birth":"1962"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/moulinRouge.jpg","Featured":false,"Actors":"Nicole Kidman"}
{"_id":{"$oid":"5de3f76726eee1442c596ea0"},"Title":"Mumford","Description":"Dr. Mumford is the new psychologist in a small town. His unique style of therapy draws many patients, including a billionaire and a woman with chronic fatigue syndrome. But Mumford also draws the ire of the town's two established doctors. Resentful of Mumford's success, they hire an attorney to impugn his character, and together they reveal shocking secrets from Mumford's past.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Lawrence Kasdan","Bio":"Lawrence Edward Kasdan is an American screenwriter, director and producer. He is best known as co-writer of The Empire Strikes Back, Raiders of the Lost Ark, Return of the Jedi, The Force Awakens, and Solo.","Birth":"1949"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/mumford.jpg","Featured":false,"Actors":"Jason Lee"}
{"_id":{"$oid":"5de3f76726eee1442c596ea1"},"Title":"Munich","Description":"After the murder of 11 Israeli athletes and their coach at the 1972 Olympics, the Israeli government secretly assigns Avner Kaufman to carry out a series of strategic retaliations. With the help of a driver, a forger , a bomb-maker and a former soldier, Avner conducts a worldwide operation, targeting 11 individuals. As the assassinations pile up, Avner begins to doubt the morality of his actions.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Steven Spielberg","Bio":"Steven Allan Spielberg KBE is an American filmmaker. He is considered one of the founding pioneers of the New Hollywood era and one of the most popular directors and producers in film history. Spielberg started in Hollywood directing television and several minor theatrical releases.","Birth":"1946"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/munich.jpg","Featured":false,"Actors":"Eric Bana"}
{"_id":{"$oid":"5de3f93a26eee1442c596ea2"},"Title":"Mystery Men","Description":"Champion City already has a superhero, the appropriately named Captain Amazing, but that doesn't deter the city's seven quirky amateur crime-fighters, who use the Captain's capture at the hands of villain Casanova Frankenstein as motivation to prove themselves. The only problem is that their strange powers -- silverware hurling, bowling, shovel skills, incompetent invisibility and deadly flatulence -- aren't doing them any favors.","Genre":{"Name":"Comedy","Description":"A comedy film is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect. Films in this style traditionally have a happy ending (black comedy being an exception)."},"Director":{"Name":"Kinka Usher","Bio":"Kinka Usher is a director of television commercials. He also directed the 1999 feature film Mystery Men.","Birth":"1960"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/mysteryMen.jpg","Featured":false,"Actors":"Janeane Garofalo"}
{"_id":{"$oid":"5de3f93a26eee1442c596ea3"},"Title":"Office Space","Description":"Corporate drone Peter Gibbons hates his soul-killing job at software company Initech. While undergoing hypnotherapy, Peter is left in a blissful state when his therapist dies in the middle of their session. He refuses to work overtime, plays games at his desk and unintentionally charms two consultants into putting him on the management fast-track. When Peter's friends learn they're about to be downsized, they hatch a revenge plot against the company inspired by ‘Superman III.’","Genre":{"Name":"Comedy","Description":"A comedy film is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect. Films in this style traditionally have a happy ending (black comedy being an exception)."},"Director":{"Name":"Mike Judge","Bio":"Michael Craig Judge is an Ecuadorian-born American actor, animator, writer, producer, director, and musician. Judge is the creator of the television series Beavis and Butt-Head, and co-creator of the television series King of the Hill, The Goode Family, Silicon Valley, and Mike Judge Presents Tales from the Tour Bus.","Birth":"1962"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/officeSpace.jpg","Featured":false,"Actors":"Stephen Root"}
{"_id":{"$oid":"5de3f93a26eee1442c596ea4"},"Title":"Orange County","Description":"A smart high-school student with his heart set on going to Stanford is horrified when his guidance counselor accidentally sends the wrong transcript with his college application. He spends the rest of the film trying to prove that he's actually a good student with a terrific grade-point average.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Jake Kasden","Bio":"Jacob ‘Jake’ Kasdan is an American film and television director, producer, screenwriter, and actor..","Birth":"1974"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/orangeCounty.jpg","Featured":false,"Actors":"Jack Black"}
{"_id":{"$oid":"5de3fb5c26eee1442c596ea5"},"Title":"Shanghai Noon","Description":"Bumbling Chon Wang works as an Imperial guard in the Forbidden City of China. When Princess Pei Pei is taken hostage, Wang pursues her captors to the wild frontier land of Nevada, where he meets good-natured thief and occasional cowboy Roy O'Bannon. Using O'Bannon's love of money, Wang convinces him to help recover the princess, and together the two form a curious partnership -- the likes of which the West has never seen.","Genre":{"Name":"Comedy","Description":"A comedy film is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect. Films in this style traditionally have a happy ending (black comedy being an exception)."},"Director":{"Name":"Tom Dey","Bio":"Thomas Ridgeway ‘Tom’ Dey is an American film director, screenwriter, and producer. His credits include Shanghai Noon, Showtime, Failure to Launch, and Marmaduke.","Birth":"1965"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/shanhaiNoon.jpg","Featured":false,"Actors":["Owen Wilson","Jackie Chan"]}
{"_id":{"$oid":"5de3fb5c26eee1442c596ea6"},"Title":"Sherlock Holmes","Description":"When a string of brutal murders terrorizes London, it doesn't take long for legendary detective Sherlock Holmes and his crime-solving partner, Dr. Watson, to find the killer, Lord Blackwood . A devotee of the dark arts, Blackwood has a bigger scheme in mind, and his execution plays right into his plans. The game is afoot when Blackwood seems to rise from the grave, plunging Holmes and Watson into the world of the occult and strange technologies.","Genre":{"Name":"Thriller","Description":"Thriller is a genre that revolves around anticipation and suspense. The aim for Thrillers is to keep the audience alert and on the edge of their seats. The protagonist in these films is set against a problem – an escape, a mission, or a mystery."},"Director":{"Name":"Guy Ritchie","Bio":"Guy Stuart Ritchie is an English film director, film producer, screenwriter, and businessman, known for his British gangster films. He left his boarding school at age 15 and got entry-level jobs in the film industry in the mid-1980s. Ritchie eventually went on to direct commercials.","Birth":"1968"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/sherlockHolmes.jpg","Featured":false,"Actors":"Robert Downey Jr."}
{"_id":{"$oid":"5de3fb5c26eee1442c596ea7"},"Title":"Sin City","Description":"In this quartet of neo-noir tales, a mysterious salesman narrates a tragic story of co-dependency, while a musclebound vigilante tears his way through the criminal underworld in search of his lost love. In another part of the city, a grizzled cop foils the ambitions of a child-killer, and an ex-prostitute evades her ex-pimp with the help of her new boyfriend, Dwight.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Frank Miller","Bio":"Frank Miller is an American comic book writer, penciller and inker, novelist, screenwriter, film director, and producer best known for his comic book stories and graphic novels such as Ronin, Daredevil: Born Again, The Dark Knight Returns, Batman Year One, Sin City, and 300.","Birth":"1957"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/sinCity.jpg","Featured":false,"Actors":"Rosario Dawson"}
{"_id":{"$oid":"5de3fe5f26eee1442c596ea8"},"Title":"Sleepy Hollow","Description":"Set in 1799, ‘Sleepy Hollow’ is based on Washington Irving's classic tale ‘The Legend of Sleepy Hollow.’ Faithful to the dreamy custom-bound world that Irving paints in his story, the film mixes horror, fantasy and romance and features an extraordinary cast of characters that dabble in the supernatural.","Genre":{"Name":"Horror","Description":"A horror film is a film that seeks to elicit fear for entertainment purposes. Initially inspired by literature from authors like Edgar Allan Poe, Bram Stoker, and Mary Shelley, horror has existed as a film genre for more than a century. The macabre and the supernatural are frequent themes."},"Director":{"Name":"Tim Burton","Bio":"Timothy Walter Burton is an American director, producer, artist, writer, and animator. He is known for his dark, gothic, and eccentric horror and fantasy films such as Beetlejuice, Batman, and Edward Scissorhands.","Birth":"1958"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/sleepyHollow.jpg","Featured":false,"Actors":"Christina Ricci"}
{"_id":{"$oid":"5de3fe5f26eee1442c596ea9"},"Title":"Spawn","Description":"Covert government assassin Al Simmons is killed after being double-crossed by his boss, Jason Wynn. Upon arriving in Hell, Simmons is offered an opportunity to return to Earth if he's willing to lead an evil army. He accepts, and is reincarnated as a ‘Hellspawn’ -- a twisted, horribly disfigured version of his former self. However, Spawn serves as a force of good, much to the dismay of the Devil's henchman, a wicked clown.","Genre":{"Name":"Action","Description":"Action films are a film genre where action sequences, such as fighting, stunts, car chases or explosions, take precedence over elements like characterization or complex plotting. The action typically involves individual efforts on the part of the hero, in contrast with most war films."},"Director":{"Name":"Mark A.Z. Dippé","Bio":"Mark A.Z. Dippé is an American film director and visual effects supervisor. He has directed numerous films from 1997 to the present day, starting with Spawn.","Birth":"1956"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/spawn.jpg","Featured":false,"Actors":"John Leguizamo"}
{"_id":{"$oid":"5de3fe5f26eee1442c596eaa"},"Title":"Star Trek Into Darkness","Description":"The crew of the Starship Enterprise returns home after an act of terrorism within its own organization destroys most of Starfleet and what it represents, leaving Earth in a state of crisis. With a personal score to settle, Capt. James T. Kirk leads his people on a mission to capture a one-man weapon of mass destruction, thereby propelling all of them into an epic game of life and death.","Genre":{"Name":"Science Fiction","Description":"Science fiction film (or sci-fi film) is a genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, alien worlds, extrasensory perception and time travel, along with futuristic elements such as spacecraft, robots, cyborgs, interstellar travel or other technologies."},"Director":{"Name":"J.J. Abrams","Bio":"Jeffrey Jacob Abrams, known professionally as J. J. Abrams, is an American filmmaker and comic book writer. He is known for his work in the genres of action, drama, and science fiction.","Birth":"1966"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/starTrek.jpg","Featured":false,"Actors":["Chris Pine","Zachary Quinto"]}
{"_id":{"$oid":"5de400a426eee1442c596eab"},"Title":"Star Wars Episode I – The Phantom Menace","Description":"Obi-Wan Kenobi is a young apprentice Jedi knight under the tutelage of Qui-Gon Jinn; Anakin Skywalker, who will later father Luke Skywalker and become known as Darth Vader, is just a 9-year-old boy. When the Trade Federation cuts off all routes to the planet Naboo, Qui-Gon and Obi-Wan are assigned to settle the matter.","Genre":{"Name":"Science Fiction","Description":"Science fiction film (or sci-fi film) is a genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, alien worlds, extrasensory perception and time travel, along with futuristic elements such as spacecraft, robots, cyborgs, interstellar travel or other technologies."},"Director":{"Name":"George Lucas","Bio":"George Walton Lucas Jr. is an American filmmaker and entrepreneur. Lucas is known for creating the Star Wars and Indiana Jones franchises and founding Lucasfilm, LucasArts and Industrial Light \u0026 Magic. He served as chairman of Lucasfilm before selling it to The Walt Disney Company in 2012.","Birth":"1944"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/starWarsEpisodeI.jpg","Featured":false,"Actors":"Natalie Portman"}
{"_id":{"$oid":"5de400a426eee1442c596eac"},"Title":"Star Wars Episode II – Attack of the Clones","Description":"Set ten years after the events of ‘The Phantom Menace,’ the Republic continues to be mired in strife and chaos. A separatist movement encompassing hundreds of planets and powerful corporate alliances poses new threats to the galaxy that even the Jedi cannot stem. These moves, long planned by an as yet unrevealed and powerful force, lead to the beginning of the Clone Wars -- and the beginning of the end of the Republic.","Genre":{"Name":"Science Fiction","Description":"Science fiction film (or sci-fi film) is a genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, alien worlds, extrasensory perception and time travel, along with futuristic elements such as spacecraft, robots, cyborgs, interstellar travel or other technologies."},"Director":{"Name":"George Lucas","Bio":"George Walton Lucas Jr. is an American filmmaker and entrepreneur. Lucas is known for creating the Star Wars and Indiana Jones franchises and founding Lucasfilm, LucasArts and Industrial Light \u0026 Magic. He served as chairman of Lucasfilm before selling it to The Walt Disney Company in 2012.","Birth":"1944"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/starWarsEpisodeII.jpg","Featured":false,"Actors":["Hayden Christensen","Natalie Portman"]}
{"_id":{"$oid":"5de400a426eee1442c596ead"},"Title":"Tarzan","Description":"In this Disney animated tale, the orphaned Tarzan grows up in the remote African wilderness, raised by the gentle gorilla Kala. When a British expedition enters the jungle, Tarzan encounters the beautiful Jane and recognizes that, like her, he's human. Falling in love with Jane, Tarzan is torn between embracing civilization and staying with his gorilla family, which becomes threatened by the ruthless hunter Clayton.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Chris Buck","Bio":"Chris Buck is an American film director known for co-directing Tarzan, Surf's Up, and Frozen, which won the Oscar for Best Animated Feature in 2014. He also worked as a supervising animator on Pocahontas and Home on the Range.","Birth":"1958"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/tarzan.jpg","Featured":false,"Actors":["Tony Goldwyn","Minnie Driver"]}
{"_id":{"$oid":"5de4031426eee1442c596eae"},"Title":"Teenage Mutant Ninja Turtles","Description":"In New York, mysterious radioactive ooze has mutated four sewer turtles into talking, upright-walking, crime-fighting ninjas. The intrepid heroes -- Michelangelo, Donatello , Raphael, and Leonardo -- are trained in the Ninjutsu arts by their rat sensei, Splinter. When a villainous rogue ninja, who is a former pupil of Splinter, arrives and spreads lawlessness throughout the city, it's up to the plucky turtles to stop him.","Genre":{"Name":"Science Fiction","Description":"Science fiction film (or sci-fi film) is a genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, alien worlds, extrasensory perception and time travel, along with futuristic elements such as spacecraft, robots, cyborgs, interstellar travel or other technologies."},"Director":{"Name":"Steve Barron","Bio":"Steven Barron is an Irish-born English film director, film producer, writer, and music video director. He directed the films Teenage Mutant Ninja Turtles, Coneheads and The Adventures of Pinocchio, as well as numerous music videos.","Birth":"1956"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/teenageMutantNinjaTurtle.jpg","Featured":false,"Actors":"Michelan Sisti"}
{"_id":{"$oid":"5de4031426eee1442c596eaf"},"Title":"The Haunting","Description":"This horror tale focuses on visitors to the secluded mansion of Hill House who have been called to the isolated location by Dr. David Marrow as part of a study on insomnia. However, Marrow is really investigating fear, and he plans to scare the subjects, including the introverted Nell and the seductive Theo. Unfortunately for Marrow and everyone staying at Hill House, the manor is actually haunted by an evil spirit out to torment its guests.","Genre":{"Name":"Horror","Description":"A horror film is a film that seeks to elicit fear for entertainment purposes. Initially inspired by literature from authors like Edgar Allan Poe, Bram Stoker, and Mary Shelley, horror has existed as a film genre for more than a century. The macabre and the supernatural are frequent themes."},"Director":{"Name":"Jan de Bont","Bio":"Jan de Bont is a Dutch cinematographer, director and film producer. He is widely known for directing the films Speed and Twister. As a director of photography, de Bont also shot numerous blockbusters and genre films, including Cujo, Flesh and Blood, Die Hard, The Hunt for Red October, and Basic Instinct.","Birth":"1943"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/theHaunting.jpg","Featured":false,"Actors":"Lili Taylor"}
{"_id":{"$oid":"5de4031426eee1442c596eb0"},"Title":"The Nice Guys","Description":"Holland March is a down-on-his-luck private eye in 1977 Los Angeles. Jackson Healy is a hired enforcer who hurts people for a living. Fate turns them into unlikely partners after a young woman named Amelia mysteriously disappears. Healy and March soon learn the hard way that some dangerous people are also looking for Amelia. Their investigation takes them to dark places as anyone else who gets involved in the case seems to wind up dead.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Shane Black","Bio":"Shane Black is an American filmmaker and actor who has written such films as Lethal Weapon and Lethal Weapon 2, The Monster Squad, The Last Boy Scout, Last Action Hero and The Long Kiss Goodnight. As an actor, Black is best known for his role as Rick Hawkins in Predator.","Birth":"1961"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/theNiceGuys.jpg","Featured":false,"Actors":["Ryan Gosling","Russell Crowe"]}
{"_id":{"$oid":"5de4059626eee1442c596eb1"},"Title":"Mad Max 2 The Road Warrior","Description":"After avenging the death of his wife and young son at the hands of a vicious gang leader, Max drives the post-apocalyptic highways of the Australian outback, fending off attacks from nomadic tribes that prey on outsiders. Falling into an encampment led by the relatively peaceful Pappagallo, Max at first schemes to steal their oil, but soon becomes the group's reluctant defender against the hulking Humungus and his ruthless marauders.","Genre":{"Name":"Action","Description":"Action films are a film genre where action sequences, such as fighting, stunts, car chases or explosions, take precedence over elements like characterization or complex plotting. The action typically involves individual efforts on the part of the hero, in contrast with most war films."},"Director":{"Name":"George Miller","Bio":"George Miller AO is an Australian filmmaker and former physician. He is best known for his Mad Max franchise, whose second installment The Road Warrior and fourth, Fury Road, have been hailed as amongst the greatest action films of all time.","Birth":"1945"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/theRoadWarrior.jpg","Featured":false,"Actors":"Mel Gibson"}
{"_id":{"$oid":"5de4059626eee1442c596eb2"},"Title":"The Sixth Sense","Description":"Young Cole Sear is haunted by a dark secret: he is visited by ghosts. Cole is frightened by visitations from those with unresolved problems who appear from the shadows. He is too afraid to tell anyone about his anguish, except child psychologist Dr. Malcolm Crowe. As Dr. Crowe tries to uncover the truth about Cole's supernatural abilities, the consequences for client and therapist are a jolt that awakens them both to something unexplainable.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"M. Night Shyamalan","Bio":"Manoj Nelliyattu ‘M. Night’ Shyamalan is an American filmmaker and actor. He is known for making films with contemporary supernatural plots and twist endings. He was born in Mahé, Puducherry, India, and raised in Penn Valley, Pennsylvania. The cumulative gross of his films exceeds 3 billion dollars globally.","Birth":"1970"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/theSixthSense.jpg","Featured":false,"Actors":["Haley Joel Osment","Bruce Willis"]}
{"_id":{"$oid":"5de4059626eee1442c596eb3"},"Title":"The Tingler","Description":"Dr. Warren Chapin has made a surprising discovery -- the spine-chilling sensation that people get when scared is due to a parasite that he dubs the ‘tingler.’ Chapin concludes that in extreme circumstances, prolonged fear can cause the creature to damage a person's spine and even cause death if the victim can't scream, a theory that Oliver Higgins uses to deadly effect on his wife. Soon the tingler that killed the woman is on the loose.","Genre":{"Name":"Horror","Description":"A horror film is a film that seeks to elicit fear for entertainment purposes. Initially inspired by literature from authors like Edgar Allan Poe, Bram Stoker, and Mary Shelley, horror has existed as a film genre for more than a century. The macabre and the supernatural are frequent themes."},"Director":{"Name":"William Castle","Bio":"William Castle was an American film director, producer, screenwriter, and actor. Orphaned at 11, Castle dropped out of high school at 15 to work in the theater. He came to the attention of Columbia Pictures for his talent for promotion and was hired.","Birth":"1914","Death":"1977"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/theTingler.jpg","Featured":false,"Actors":"Vincent Price"}
{"_id":{"$oid":"5de40adc26eee1442c596eb4"},"Title":"The Thomas Crown Affair","Description":"Bored billionaire Thomas Crown decides to entertain himself by stealing a Monet from a reputed museum. When Catherine Banning, an investigator for the museum's insurance company, takes an interest in Crown, a complicated back-and-forth game with romantic undertones begins between them. In an attempt to find out where Banning's loyalties lie, Crown returns the painting and essentially turns himself in, hoping that Banning's feelings for him will lead to an escape.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"John McTiernan","Bio":"John Campbell McTiernan Jr. is an American filmmaker. He is best known for his action films, especially Predator, Die Hard, and The Hunt for Red October.","Birth":"1951"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/thomasCrownAffair.jpg","Featured":false,"Actors":"Pierce Brosnan"}
{"_id":{"$oid":"5de40b0526eee1442c596eb5"},"Title":"Thor The Dark World","Description":"In ancient times, the gods of Asgard fought and won a war against an evil race known as the Dark Elves. The survivors were neutralized, and their ultimate weapon -- the Aether -- was buried in a secret location. Hundreds of years later, Jane Foster finds the Aether and becomes its host, forcing Thor to bring her to Asgard before Dark Elf Malekith captures her and uses the weapon to destroy the Nine Realms -- including Earth.","Genre":{"Name":"Science Fiction","Description":"Science fiction film (or sci-fi film) is a genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, alien worlds, extrasensory perception and time travel, along with futuristic elements such as spacecraft, robots, cyborgs, interstellar travel or other technologies."},"Director":{"Name":"Alan Taylor","Bio":"Alan Taylor is an American television and film director. He is known for his work on TV shows such as Lost, The West Wing, Six Feet Under, Sex and the City, The Sopranos, Game of Thrones, Boardwalk Empire, Deadwood, and Mad Men. He also directed films such as Palookaville, Thor The Dark World, and Terminator Genisys","Birth":"1965"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/thorTheDarkWorld.jpg","Featured":false,"Actors":["Chris Hemsworth","Tom Hiddleston"]}
{"_id":{"$oid":"5de40c2f26eee1442c596eb6"},"Title":"Alien","Description":"In deep space, the crew of the commercial starship Nostromo is awakened from their cryo-sleep capsules halfway through their journey home to investigate a distress call from an alien vessel. The terror begins when the crew encounters a nest of eggs inside the alien ship. An organism from inside an egg leaps out and attaches itself to one of the crew, causing him to fall into a coma.","Genre":{"Name":"Science Fiction","Description":"Science fiction film (or sci-fi film) is a genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, alien worlds, extrasensory perception and time travel, along with futuristic elements such as spacecraft, robots, cyborgs, interstellar travel or other technologies."},"Director":{"Name":"Ridley Scott","Bio":"Sir Ridley Scott is an English filmmaker. Following his commercial breakthrough in 1979 with the science fiction horror film Alien, further works include the neo-noir dystopian film Blade Runner, the road adventure film Thelma \u0026 Louise, the historical drama Gladiator and the science fiction film The Martian.","Birth":"1937"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/alien.jpg","Featured":false,"Actors":"John Hurt"}
{"_id":{"$oid":"5de40e7226eee1442c596eb7"},"Title":"Toy Story","Description":"Woody, a good-hearted cowboy doll who belongs to a young boy named Andy, sees his position as Andy's favorite toy jeopardized when his parents buy him a Buzz Lightyear action figure. Even worse, the arrogant Buzz thinks he's a real spaceman on a mission to return to his home planet. When Andy's family moves to a new house, Woody and Buzz must escape the clutches of maladjusted neighbor Sid Phillips and reunite with their boy.","Genre":{"Name":"Comedy","Description":"A comedy film is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect. Films in this style traditionally have a happy ending (black comedy being an exception)."},"Director":{"Name":"John Lasseter","Bio":"John Alan Lasseter is an American animator, film director, screenwriter, producer, and former chief creative officer of Walt Disney Animation Studios, Pixar and Disneytoon Studios. He was also the Principal Creative Advisor for Walt Disney Imagineering.","Birth":"1957"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/toyStory.jpg","Featured":false,"Actors":["Tim Allen","Tom Hanks"]}
{"_id":{"$oid":"5de40e7226eee1442c596eb8"},"Title":"Toy Story 2","Description":"Woody is stolen from his home by toy dealer Al McWhiggin, leaving Buzz Lightyear and the rest of the gang to try to rescue him. But when Woody discovers that he's actually a valuable collectible from a once-popular television show called ‘Woody's Roundup’ and is reunited with his horse Bullseye, Jessie the yodeling cowgirl and his faithful sidekick, Stinky Pete the Prospector, he doesn't want to leave.","Genre":{"Name":"Comedy","Description":"A comedy film is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect. Films in this style traditionally have a happy ending (black comedy being an exception)."},"Director":{"Name":"John Lasseter","Bio":"John Alan Lasseter is an American animator, film director, screenwriter, producer, and former chief creative officer of Walt Disney Animation Studios, Pixar and Disneytoon Studios. He was also the Principal Creative Advisor for Walt Disney Imagineering.","Birth":"1957"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/toyStory2.jpg","Featured":false,"Actors":["Joan Cusack","Tom Hanks"]}
{"_id":{"$oid":"5de40e7226eee1442c596eb9"},"Title":"War for the Planet of the Apes","Description":"Caesar and his apes are forced into a deadly conflict with an army of humans led by a ruthless colonel. After the apes suffer unimaginable losses, Caesar wrestles with his darker instincts and begins his own mythic quest to avenge his kind. As the journey finally brings them face to face, Caesar and the colonel are pitted against each other in an epic battle that will determine the fate of both of their species and the future of the planet.","Genre":{"Name":"Science Fiction","Description":"Science fiction film (or sci-fi film) is a genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, alien worlds, extrasensory perception and time travel, along with futuristic elements such as spacecraft, robots, cyborgs, interstellar travel or other technologies."},"Director":{"Name":"Matt Reeves","Bio":"Matt Reeves is an American filmmaker. After several years working in film and television, Reeves made his cinematic directorial debut with The Pallbearer, starring David Schwimmer, Gwyneth Paltrow and Toni Collette.","Birth":"1966"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/warForThePlanetOfTheApes.jpg","Featured":false,"Actors":["Karin Konoval","Amiah Miller"]}
{"_id":{"$oid":"5de4111f26eee1442c596eba"},"Title":"War Horse","Description":"Albert and his beloved horse, Joey, live on a farm in the British countryside. At the outbreak of World War I, Albert and Joey are forcibly parted when Albert's father sells the horse to the British cavalry. Against the backdrop of the Great War, Joey begins an odyssey full of danger, joy and sorrow, and he transforms everyone he meets along the way. Meanwhile Albert, unable to forget his equine friend, searches the battlefields of France to find Joey and bring him home.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Steven Spielberg","Bio":"Steven Allan Spielberg KBE is an American filmmaker. He is considered one of the founding pioneers of the New Hollywood era and one of the most popular directors and producers in film history. Spielberg started in Hollywood directing television and several minor theatrical releases.","Birth":"1946"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/warHorse.jpg","Featured":false}
{"_id":{"$oid":"5de4111f26eee1442c596ebb"},"Title":"What Lies Beneath","Description":"It had been a year since Dr. Norman Spencer  betrayed his beautiful wife, Claire. But with Claire oblivious to the truth, Norman's life and marriage seem so perfect that when Claire tells him of hearing mysterious voices and seeing a young woman's image in their home, he dismisses her terror as delusion. Claire moves closer to the truth and it becomes clear that this apparition will not be dismissed, and has come back for Dr. Spencer and his beautiful wife.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Robert Zemeckis","Bio":"Robert Lee Zemeckis is an American director, film producer and screenwriter frequently credited as an innovator in visual effects.","Birth":"1952"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/whatLiesBeneath.jpg","Featured":false,"Actors":"Harrison Ford"}
{"_id":{"$oid":"5de4111f26eee1442c596ebc"},"Title":"White Men Can’t Jump","Description":"Billy Hoyle is a white basketball hustler who banks on black players underestimating his skills on the court. When he pulls one over on Sidney Deane, his victim sees a lucrative opportunity, and they become partners in the con game, plying their trade across the courts of Los Angeles. Meanwhile, Billy has to keep one step ahead of mobsters, to whom he owes money, while staying on the good side of his ‘Jeopardy!’-obsessed, motormouth wife.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Ron Shelton","Bio":"Ronald Wayne Shelton is an American film director and screenwriter and former minor league baseball infielder. Shelton is known for the many films he has made about sports. His 1988 film Bull Durham, based in-part off his own baseball experiences, earned him an Academy Award nomination for Best Original Screenplay.","Birth":"1945"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/whiteMenCantJump.jpg","Featured":false,"Actors":["Wesley Snipes","Woody Harrelson"]}
{"_id":{"$oid":"5de4111f26eee1442c596ebd"},"Title":"Zero Dark Thirty","Description":"Following the terrorist attacks of Sept. 11, 2001, Osama bin Laden becomes one of the most-wanted men on the planet. The worldwide manhunt for the terrorist leader occupies the resources and attention of two U.S. presidential administrations. Ultimately, it is the work of a dedicated female operative that proves instrumental in finally locating bin Laden. In May 2011, Navy SEALs launch a nighttime strike, killing bin Laden in his compound in Abbottabad, Pakistan.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between. Each of the types of subject-matter themes have various kinds of dramatic plots. Dramatic films are probably the largest film genre because they include a broad spectrum of films."},"Director":{"Name":"Kathryn Bigelow","Bio":"Kathryn Ann Bigelow is an American film director, producer, and screenwriter. Covering a wide range of genres, her films include Near Dark, Point Break, Strange Days, K-19: The Widowmaker, The Hurt Locker, Zero Dark Thirty, and Detroit.","Birth":"1951"},"ImagePath":"https://design-and-a-movie-images.s3.us-east-2.amazonaws.com/zeroDarkThirty.jpg","Featured":false,"Actors":"Jessica Chastain"}
